iwa1836/PROBO-Kel-2/PROBO_ESP32/src/main.cpp
#pragma region Include Libraries
#include <Arduino.h>
#include <WiFi.h>
#include <WebSocketsServer.h>
#include <ESP32PWM.h>
#include <ESP32Servo.h>
#include <Preferences.h>
#include <QuickPID.h>
#pragma endregion

#pragma region Pin Definitions
#define ENCR_A 39
#define ENCR_B 36
#define ENCL_A 35
#define ENCL_B 34

#define LT_SENS_ADC 32
#define PHOTODIODE_ADC 33

#define MUX_A0 26
#define MUX_A1 27
#define MUX_A2 14

#define BUTTON_1 12
#define BUTTON_2 13

#define BUZZ_PIN 23

#define MOTOR_S_REL 1
#define MOTOR_R_1 19
#define MOTOR_R_2 18
#define MOTOR_L_1 5
#define MOTOR_L_2 17

#define SERVO_1 16
#define SERVO_2 4
#define SERVO_5 15

#define STEPPER_STEP 2
#define STEPPER_DIR 0
#pragma endregion

#pragma region Variables
#define AP_SSID "PROBO KEL 2"
#define AP_PASS "123321abccba"

unsigned long currMill, prevMill, currTimeout, startTimeout;
const uint16_t sendingInterval = 50, dropBallTimeout = 8000;
uint8_t leftAxisX, leftAxisY, rightAxisX, rightAxisY;
uint16_t buttons;
uint8_t telemetryData[20], configData[18];
uint32_t packetCount, simStartPacketCount;
uint8_t LTSensor[8], LTSensor_HIGH[8], LTSensor_LOW[8], speed, ballColor, ballADC, LTThreshold, ballThreshold, autoIndex, servoAngle = 90;
bool startPoint, stepState, simModeState;
uint16_t stepCount;
float PIDSetpoint = 0, PIDInput, PIDOutput;

typedef enum {
	PROBO_CONFIG,
	PROBO_READY,
	PROBO_AUTO_SEARCH_BALL,
	PROBO_AUTO_PICK_BALL,
	PROBO_AUTO_DELIVER_BALL,
	PROBO_AUTO_DROP_BALL_1,
	PROBO_AUTO_DROP_BALL_2,
	PROBO_AUTO_DROP_BALL_3,
	PROBO_AUTO_DROP_BALL_4,
	PROBO_AUTO_SEARCH_MANUAL,
	PROBO_MANUAL_RUNNING,
	PROBO_MANUAL_PICK_BALL,
	PROBO_MANUAL_SHOOT_BALL
} State;

typedef enum {
	KIRI,
	KANAN
} StepDirection;

typedef enum {
	INVALID,
	ORANGE,
	WHITE
} BallColor;

typedef union {
	uint8_t bytes[4];
	float floatVal;
} ByteToFloat;

State proboState;
ByteToFloat Kp, Ki, Kd;

int32_t EncR_Count, EncL_Count, turnEncR_Count, turnEncL_Count;
int16_t motR_PPS, motL_PPS;
uint32_t EncR_Time, EncL_Time, lastEncR_Time, lastEncL_Time;

bool proboTurnCW, proboTurnCCW, proboCurveCW, proboCurveCCW, proboForward, proboReverse, proboStop;
#pragma endregion

#pragma region Objects
TaskHandle_t ProboState_Handle;
TaskHandle_t LTSensRead_Handle;
TaskHandle_t RevolverMove90_Handle;
TaskHandle_t Motor_Handle;
TaskHandle_t PID_Handle;
TaskHandle_t BallPicker_Handle;
TaskHandle_t BallShooting_Handle;
TaskHandle_t BallDropping_Handle;
TaskHandle_t ArmPushBall_Handle;
TaskHandle_t BallInserting_Handle;
TaskHandle_t SimMode_Handle;

WebSocketsServer wsServer(81);

Servo servo1;
Servo servo2;
Servo servo5;

ESP32PWM rightMotor1;
ESP32PWM rightMotor2;
ESP32PWM leftMotor1;
ESP32PWM leftMotor2;
ESP32PWM buzzer;

Preferences preferences;

QuickPID pid(&PIDInput, &PIDOutput, &PIDSetpoint);
#pragma endregion

#pragma region Task Codes
void ProboState(void *pvParameters) {
	for(;;) {
		if(startPoint) { // Start Point Blue
			switch(proboState) {
				case PROBO_CONFIG:
					break;

				case PROBO_READY:
					break;

				case PROBO_AUTO_SEARCH_BALL:
					switch(autoIndex) {
						// Belok kanan 90
						case 0:
							if(LTSensor[6] && LTSensor[0] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 1:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 30)) && (EncL_Count >= (turnEncL_Count + 30))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
								proboTurnCW = true;
							}
							break;

						case 2:
							if(!LTSensor[2] && !LTSensor[5]) {
								proboTurnCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						// Belok kiri 90
						case 3:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 4:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 45)) && (EncL_Count >= (turnEncL_Count + 45))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
								proboTurnCCW = true;
							}
							break;

						case 5:
							if(!LTSensor[2] && !LTSensor[5]) {
								proboTurnCCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						// Percabangan T
						case 6:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex = 0;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
								proboState = PROBO_AUTO_PICK_BALL;
							}
							break;

						default:
							break;
					}
					break;

				/*case PROBO_AUTO_PICK_BALL: // Pick 4 Balls
					switch(autoIndex) {
						// Belok kiri
						case 0:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 150)) && (EncL_Count >= (turnEncL_Count + 150))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								speed += 32;
								proboTurnCCW = true;
								turnEncR_Count = EncR_Count;
							}
							break;

						case 1:
							pid.Reset();
							if(proboTurnCCW && (EncR_Count == (turnEncR_Count + 180))) {
								speed -= 32;
								proboTurnCCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								proboForward = true;
								autoIndex++;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Ambil bola kanan
						case 2:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 35)) && (EncL_Count >= (turnEncL_Count + 35))) {
								proboForward = false;
								proboStop = true;
								autoIndex++;
							}
							break;

						case 3:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							vTaskResume(BallPicker_Handle);
							break;

						// Ambil bola kiri
						case 4:
							if(eTaskGetState(BallPicker_Handle) == eSuspended) {
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(RevolverMove90_Handle);
								proboStop = false;
								proboTurnCW = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 5:
							pid.Reset();
							if(proboTurnCW && (EncL_Count == (turnEncL_Count + 120))) {
								proboTurnCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								proboReverse = true;
								autoIndex++;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

