iwa1836/PROBO-Kel-2/PROBO_ESP32/src/main.cpp
						case 6:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 180)) && (EncL_Count <= (turnEncL_Count - 180))) {
								proboReverse = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								proboTurnCCW = true;
								speed += 32;
								autoIndex++;
								turnEncR_Count = EncR_Count;
							}
							break;

						case 7:
							pid.Reset();
							if(proboTurnCCW && (EncR_Count == (turnEncR_Count + 120))) {
								speed -= 32;
								autoIndex++;
								proboTurnCCW = false;
								proboStop = true;
							}
							break;

						case 8:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							vTaskResume(BallPicker_Handle);
							break;

						// Putar balik
						case 9:
							if(eTaskGetState(BallPicker_Handle) == eSuspended) {
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(RevolverMove90_Handle);
								proboStop = false;
								proboTurnCW = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 10:
							pid.Reset();
							if(proboTurnCW && (EncL_Count >= (turnEncL_Count + 250))) {
								autoIndex = 0;
								pid.Reset();
								proboTurnCW = false;
								proboState = PROBO_AUTO_DELIVER_BALL;
							}
							break;

						default:
							break;
					}
					break;*/

				case PROBO_AUTO_PICK_BALL: // Pick 2 Balls Direct
					switch(autoIndex) {
						case 0:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 50)) && (EncL_Count >= (turnEncL_Count + 50))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
								proboTurnCCW = true;
							}
							break;

						case 1:
							if(!LTSensor[2] && !LTSensor[5]) {
								proboTurnCCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						case 2:
							vTaskDelay(2000 / portTICK_PERIOD_MS);
							autoIndex++;
							proboReverse = true;
							turnEncR_Count = EncR_Count;
							turnEncL_Count = EncL_Count;
							break;

						case 3:
							if((EncR_Count <= (turnEncR_Count - 45)) && (EncL_Count <= (turnEncL_Count - 45))) {
								proboReverse = false;
								proboStop = true;
								autoIndex++;
							}
							break;

						case 4:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							vTaskResume(BallPicker_Handle);
							break;

						case 5:
							if(eTaskGetState(BallPicker_Handle) == eSuspended) {
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								vTaskResume(RevolverMove90_Handle);
								proboStop = false;
								proboTurnCW = true;
								vTaskDelay(700 / portTICK_PERIOD_MS);
								autoIndex++;
							}
							break;

						case 6:
							pid.Reset();
							if(!LTSensor[7] && !LTSensor[3]) {
								proboTurnCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex = 0;
								pid.Reset();
								proboState = PROBO_AUTO_DELIVER_BALL;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_DELIVER_BALL:
					if(eTaskGetState(BallInserting_Handle) == eSuspended) {
						vTaskResume(BallInserting_Handle);
					}
					switch(autoIndex) {
						// Percabangan T
						case 0:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 1:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 30)) && (EncL_Count >= (turnEncL_Count + 30))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(5000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex = 0;
								pid.Reset();
								speed += 16;
								proboTurnCW = true;
								turnEncL_Count = EncL_Count;
								proboState = PROBO_AUTO_DROP_BALL_1;
							}
							break;

						default:
							break;

					}
					break;

				case PROBO_AUTO_DROP_BALL_1:
					if(eTaskGetState(BallInserting_Handle) != eSuspended) {
						vTaskSuspend(BallInserting_Handle);
					}
					if(ballColor == INVALID && eTaskGetState(RevolverMove90_Handle) == eSuspended && eTaskGetState(BallDropping_Handle) == eSuspended) {
						vTaskResume(RevolverMove90_Handle);
					}
					switch(autoIndex) {
						// Belok kanan
						case 0:
							if(proboTurnCW && (EncL_Count == (turnEncL_Count + 140))) {
								speed -= 16;
								proboTurnCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						// Percabangan + 1
						case 1:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								pid.Reset();
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								pid.Reset();
							}
							break;

						// Percabangan + 2
						case 2:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 3:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 45)) && (EncL_Count >= (turnEncL_Count + 45))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								pid.Reset();
								autoIndex++;
								speed += 8;
								proboTurnCW = true;
								turnEncL_Count = EncL_Count;
							}
							break;

