iwa1836/PROBO-Kel-2/PROBO_ESP32/src/main.cpp
						// Mundur
						case 4:
							pid.Reset();
							if(!LTSensor[7] && !LTSensor[3] && (EncL_Count >= (turnEncL_Count + 100))) {
								speed -= 8;
								proboTurnCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								pid.Reset();
								autoIndex++;
								proboReverse = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 5:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 140)) && (EncL_Count <= (turnEncL_Count - 140))) {
								autoIndex++;
								proboReverse = false;
								proboStop = true;
								startTimeout = millis();
							}
							break;

						// Drop bola 1
						case 6:
							if(ballColor != INVALID && eTaskGetState(RevolverMove90_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(BallDropping_Handle);
							}
							currTimeout = millis();
							if((currTimeout - startTimeout) >= dropBallTimeout) {
								autoIndex++;
							}
							break;

						// Maju ke drop bola 2
						case 7:
							if(eTaskGetState(BallDropping_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex = 0;
								pid.Reset();
								proboStop = false;
								proboState = PROBO_AUTO_DROP_BALL_2;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_DROP_BALL_2:
					if(ballColor == INVALID && eTaskGetState(RevolverMove90_Handle) == eSuspended && eTaskGetState(BallDropping_Handle) == eSuspended) {
						vTaskResume(RevolverMove90_Handle);
					}
					switch(autoIndex) {
						// Percabangan +
						case 0:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 1:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 45)) && (EncL_Count >= (turnEncL_Count + 45))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
								proboTurnCW = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Belok kanan arah drop bola 2
						case 2:
							if(!LTSensor[2] && !LTSensor[5] && (EncL_Count >= (turnEncL_Count + 100))) {
								proboTurnCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						// Percabangan + 1
						case 3:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								pid.Reset();
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								pid.Reset();
							}
							break;

						// Percabangan + 2
						case 4:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 5:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 70)) && (EncL_Count >= (turnEncL_Count + 70))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								pid.Reset();
								autoIndex++;
								speed += 8;
								proboTurnCCW = true;
								turnEncR_Count = EncR_Count;
							}
							break;

						// Mundur
						case 6:
							pid.Reset();
							if(!LTSensor[0] && !LTSensor[4] && (EncR_Count >= (turnEncR_Count + 100))) {
								speed -= 8;
								proboTurnCCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								pid.Reset();
								autoIndex++;
								proboReverse = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 7:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 140)) && (EncL_Count <= (turnEncL_Count - 140))) {
								autoIndex++;
								proboReverse = false;
								proboStop = true;
								startTimeout = millis();
							}
							break;

						// Drop bola 2
						case 8:
							if(ballColor != INVALID && eTaskGetState(RevolverMove90_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(BallDropping_Handle);
							}
							currTimeout = millis();
							if((currTimeout - startTimeout) >= dropBallTimeout) {
								autoIndex++;
							}
							break;

						// Maju ke search manual
						case 9:
							if(eTaskGetState(BallDropping_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex = 0;
								pid.Reset();
								proboStop = false;
								proboState = PROBO_AUTO_SEARCH_MANUAL;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_DROP_BALL_3:
					break;

				case PROBO_AUTO_DROP_BALL_4:
					break;

				case PROBO_AUTO_SEARCH_MANUAL:
					switch(autoIndex) {
						// Percabangan +
						case 0:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 1:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 70)) && (EncL_Count >= (turnEncL_Count + 70))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
								speed += 16;
								proboTurnCW = true;
								turnEncL_Count = EncL_Count;
							}
							break;

