iwa1836/PROBO-Kel-2/PROBO_ESP32/src/main.cpp
						case 2:
							if(!LTSensor[2] && !LTSensor[5] && (EncL_Count >= (turnEncL_Count + 100))) {
								speed -= 16;
								proboTurnCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						case 3:
							proboForward = true;
							vTaskDelay(500 / portTICK_PERIOD_MS);
							proboForward = false;
							autoIndex++;
							break;

						// Belok kiri 90
						case 4:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 5:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 45)) && (EncL_Count >= (turnEncL_Count + 45))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
								proboTurnCCW = true;
							}
							break;

						case 6:
							if(!LTSensor[2] && !LTSensor[5]) {
								proboTurnCCW = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						// Curve kanan
						case 7:
							if(LTSensor[6] && LTSensor[0] && LTSensor[4] && LTSensor[2] && LTSensor[5] && LTSensor[7] && LTSensor[3] && !LTSensor[1]) {
								speed += 16;
								proboCurveCW = true;
								autoIndex++;
							}
							break;

						case 8:
							if(!LTSensor[4] && !LTSensor[2]) {
								speed -= 16;
								proboCurveCW = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						// Curve kiri
						case 9:
							if(!LTSensor[6] && LTSensor[0] && LTSensor[4] && LTSensor[2] && LTSensor[5] && LTSensor[7] && LTSensor[3] && LTSensor[1]) {
								speed += 16;
								proboCurveCCW = true;
								autoIndex++;
							}
							break;

						case 10:
							if(!LTSensor[4] && !LTSensor[2]) {
								speed -= 16;
								proboCurveCCW = false;
								autoIndex++;
								pid.Reset();
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_MANUAL_RUNNING:
					break;

				case PROBO_MANUAL_PICK_BALL:
					break;

				case PROBO_MANUAL_SHOOT_BALL:
					break;

				default:
					buzzer.writeNote(NOTE_C, 6);
					vTaskDelay(100 / portTICK_PERIOD_MS);
					buzzer.write(0);
					vTaskDelay(100 / portTICK_PERIOD_MS);
					break;
			}
		}/* else { // Start Point Red
			switch(proboState) {
				case PROBO_CONFIG:
					break;

				case PROBO_READY:
					break;

				case PROBO_AUTO_SEARCH_BALL:
					switch(autoIndex) {
						// Belok kiri 90
						case 0:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboLeftTurnForward = true;
								turnEncR_Count = EncR_Count;
							}
							break;

						case 1:
							if(proboLeftTurnForward && (EncR_Count == (turnEncR_Count + 220))) {
								autoIndex++;
								pid.Reset();
								proboLeftTurnForward = false;
							}
							break;

						// Belok kanan 90
						case 2:
							if(LTSensor[6] && LTSensor[0] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								speed += 32;
								autoIndex++;
								proboRightTurnForward = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 3:
							if(proboRightTurnForward && (EncL_Count == (turnEncL_Count + 235))) {
								speed -= 32;
								autoIndex++;
								pid.Reset();
								proboRightTurnForward = false;
							}
							break;

						// Percabangan T
						case 4:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								autoIndex = 0;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
								proboState = PROBO_AUTO_PICK_BALL;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_PICK_BALL:
					switch(autoIndex) {
						// Belok kanan
						case 0:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 100)) && (EncL_Count >= (turnEncL_Count + 100))) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								speed += 32;
								autoIndex++;
								proboRightTurnForward = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 1:
							if(proboRightTurnForward && (EncL_Count == (turnEncL_Count + 235))) {
								speed -= 32;
								autoIndex++;
								proboRightTurnForward = false;
							}
							break;

						// Ambil bola kiri
						case 2:
							autoIndex++;
							proboStop = true;
							break;

						case 3:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							vTaskResume(BallPicker_Handle);
							break;

						// Ambil bola kanan
						case 4:
							if(eTaskGetState(BallPicker_Handle) == eSuspended) {
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(RevolverMove90_Handle);
								proboStop = false;
								proboReverse = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 5:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 175)) && (EncL_Count <= (turnEncL_Count - 175))) {
								proboReverse = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								speed += 32;
								autoIndex++;
								proboRightTurnForward = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 6:
							if(proboRightTurnForward && (EncL_Count == (turnEncL_Count + 245))) {
								speed -= 32;
								proboRightTurnForward = false;
								proboStop = true;
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								proboStop = false;
								autoIndex++;
								proboLeftTurnForward = true;
								turnEncR_Count = EncR_Count;
							}
							break;

						case 7:
							if(proboLeftTurnForward && (EncR_Count == (turnEncR_Count + 260))) {
								autoIndex++;
								proboLeftTurnForward = false;
								proboStop = true;
							}
							break;

						case 8:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							vTaskResume(BallPicker_Handle);
							break;

