iwa1836/PROBO-Kel-2/PROBO_ESP32/src/main.cpp
				case 3100: // Garis lurus kedua
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3300: // Curve kiri
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 0;
					LTSensor[0] = 0;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3400: // Garis lurus ketiga
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3600: // Curve kanan
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 0;
					LTSensor[1] = 0;
					break;
					
				case 3700: // Garis lurus terakhir
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3740: // No line
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3800: // Kotak finish
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
				#pragma endregion
					
				default:
					buzzer.write(0);
					break;
			}
		} else { // Start Point Red
			switch(simStartPacketCount) {
				#pragma region Sim LT 90 Degrees
				case 0: // Starting
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;

				case 20: // Kotak start
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;

				case 40: // Garis awal
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;

				case 100: // Belok kotak 90 kiri
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;

				case 120: // Garis lurus kedua
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 200: // Belok kotak 90 kanan
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 220: // Garis lurus ketiga
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 300: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT After Pick Ball
				case 500: // Garis lurus dari bola
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 600: // Percabangan kiri
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 610: // Garis lurus
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 700: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 720: // Garis lurus arah drop bola
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 760: // Percabangan drop bola 1
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT After Drop Ball 1
				case 770: // Garis lurus dari drop bola 1
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
