iwa1836/PROBO-Kel-2/PROBO_ESP32/src/main.cpp
				case 3100: // Garis lurus kedua
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3300: // Curve kanan
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 0;
					LTSensor[1] = 0;
					break;
					
				case 3400: // Garis lurus ketiga
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3600: // Curve kiri
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 0;
					LTSensor[0] = 0;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3700: // Garis lurus terakhir
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3740: // No line
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3800: // Kotak finish
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
				#pragma endregion
					
				default:
					buzzer.write(0);
					break;
			}
		}
		vTaskDelay(1 / portTICK_PERIOD_MS);
	}
}
#pragma endregion

#pragma region Function Codes
void sendConfig() {
	startPoint = preferences.getBool("StartPoint", 0);
	Kp.floatVal = preferences.getFloat("Kp", 0);
	Ki.floatVal = preferences.getFloat("Ki", 0);
	Kd.floatVal = preferences.getFloat("Kd", 0);
	speed = preferences.getUChar("Speed", 0);
	LTThreshold = preferences.getUChar("LTThreshold", 0);
	ballThreshold = preferences.getUChar("BallThreshold", 0);
	
	configData[0] = 0x5A;
	configData[1] = startPoint;
	configData[2] = Kp.bytes[0];
	configData[3] = Kp.bytes[1];
	configData[4] = Kp.bytes[2];
	configData[5] = Kp.bytes[3];
	configData[6] = Ki.bytes[0];
	configData[7] = Ki.bytes[1];
	configData[8] = Ki.bytes[2];
	configData[9] = Ki.bytes[3];
	configData[10] = Kd.bytes[0];
	configData[11] = Kd.bytes[1];
	configData[12] = Kd.bytes[2];
	configData[13] = Kd.bytes[3];
	configData[14] = speed;
	configData[15] = LTThreshold;
	configData[16] = ballThreshold;
	configData[17] = simModeState;
	wsServer.broadcastBIN(configData, sizeof(configData));
}

void clientConnected() {
	buzzer.writeNote(NOTE_C, 5);
	vTaskDelay(50 / portTICK_PERIOD_MS);
	buzzer.writeNote(NOTE_G, 5);
	vTaskDelay(50 / portTICK_PERIOD_MS);
	buzzer.write(0);
}

void clientDisconnected() {
	buzzer.writeNote(NOTE_G, 5);
	vTaskDelay(50 / portTICK_PERIOD_MS);
	buzzer.writeNote(NOTE_C, 5);
	vTaskDelay(50 / portTICK_PERIOD_MS);
	buzzer.write(0);
}

void onWebSocketEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t length) {
	switch(type) {
		case WStype_CONNECTED:
			clientConnected();
			sendConfig();
			break;

		case WStype_DISCONNECTED:
			clientDisconnected();
			break;

		case WStype_BIN:
			// CONFIG to READY
			if((payload[0] == 0xAA) && (proboState == PROBO_CONFIG)) {
				proboState = PROBO_READY;
				if(eTaskGetState(PID_Handle) == eSuspended) {
					pid.SetOutputLimits(speed - 255, 255 - speed);
					pid.SetTunings(Kp.floatVal, Ki.floatVal, Kd.floatVal);
					pid.Reset();
					vTaskResume(PID_Handle);
				}
				if(eTaskGetState(Motor_Handle) == eSuspended) {
					vTaskResume(Motor_Handle);
				}
				servo1.write(123);
				servo2.write(57);
			}

			// Go to CONFIG
			if((payload[0] == 0x55) && (proboState != PROBO_CONFIG)) {
				proboState = PROBO_CONFIG;
				vTaskDelay(10 / portTICK_PERIOD_MS);
				vTaskSuspend(PID_Handle);
				vTaskSuspend(Motor_Handle);
				if(eTaskGetState(BallInserting_Handle) != eSuspended) {
					vTaskSuspend(BallInserting_Handle);
				}
				if(simModeState) {
					buzzer.write(0);
					vTaskSuspend(SimMode_Handle);
				}
			}

			// Write CONFIG
			if((payload[0] == 0xA5) && (proboState == PROBO_CONFIG)) {
				startPoint = payload[1];
				Kp.bytes[0] = payload[2];
				Kp.bytes[1] = payload[3];
				Kp.bytes[2] = payload[4];
				Kp.bytes[3] = payload[5];
				Ki.bytes[0] = payload[6];
				Ki.bytes[1] = payload[7];
				Ki.bytes[2] = payload[8];
				Ki.bytes[3] = payload[9];
				Kd.bytes[0] = payload[10];
				Kd.bytes[1] = payload[11];
				Kd.bytes[2] = payload[12];
				Kd.bytes[3] = payload[13];
				speed = payload[14];
				LTThreshold = payload[15];
				ballThreshold = payload[16];
				simModeState = payload[17];

				if(simModeState) {
					vTaskSuspend(LTSensRead_Handle);
				} else {
					vTaskResume(LTSensRead_Handle);
				}

				preferences.putBool("StartPoint", startPoint);
				preferences.putFloat("Kp", Kp.floatVal);
				preferences.putFloat("Ki", Ki.floatVal);
				preferences.putFloat("Kd", Kd.floatVal);
				preferences.putUChar("Speed", speed);
				preferences.putUChar("LTThreshold", LTThreshold);
				preferences.putUChar("BallThreshold", ballThreshold);

				sendConfig();
			}

			// Calibrate LT Sensor HIGH
			if((payload[0] == 0xFF) && (proboState == PROBO_CONFIG)) {
				for(uint8_t i = 0; i < 8; i++) {
					LTSensor_HIGH[i] = LTSensor[i];
				}
			}

			// Calibrate LT Sensor LOW
			if((payload[0] == 0x00) && (proboState == PROBO_CONFIG)) {
				for(uint8_t i = 0; i < 8; i++) {
					LTSensor_LOW[i] = LTSensor[i];
				}
			}

			// Receive Joystick
			if((payload[0] == 0xFF) && (proboState >= PROBO_READY)) {
				leftAxisX = payload[1];
				leftAxisY = payload[2];
				rightAxisX = payload[3];
				rightAxisY = payload[4];
				buttons = (payload[5] << 8);
				buttons |= payload[6];

